{
  "projects": [
    {
      "id": 1,
      "title": "Clustering Data and Visualizing in 2D",
      "proposedBy": "Matthew Balogh (ELTE)",
      "description": "This project introduces students to unsupervised learning through hands-on clustering. Participants start with simple 2D datasets and advance to high-dimensional clustering using K-means and Self-Organizing Maps. The project also offers an optional contribution to a new visualization method for understanding cluster structures.",
      "useCase": "Understanding patterns in unlabeled datasets, customer segmentation, document grouping, and exploratory data analysis.",
      "skillsGained": [
        "Unsupervised learning fundamentals",
        "K-means clustering",
        "Dimensionality reduction and 2D visualization",
        "Self-Organizing Maps",
        "Applied data science workflow",
        "Optional: designing visualization tools"
      ],
      "tools": ["Python", "NumPy", "Scikit-learn", "Matplotlib", "SOM libraries"],
      "expectedOutputs": "Cluster visualizations, comparative analysis between K-means and SOM, and optional contributions to new visualization techniques."
    },
    {
      "id": 2,
      "title": "Cryptocurrencies – Price Exploration",
      "proposedBy": "Julio Llontop Calosi Rodrigo",
      "description": "This project analyzes Bitcoin and Ethereum price movements over time to determine trends, volatility, correlations, and high-activity periods. Students explore market behavior using real historical price datasets.",
      "useCase": "Financial analytics, volatility measurement, portfolio insights, and trend analysis for crypto markets.",
      "skillsGained": [
        "Time-series analysis",
        "Data cleaning and transformation",
        "Correlation analysis",
        "Volatility measurement",
        "Data visualization"
      ],
      "tools": ["Python", "Pandas", "Matplotlib/Plotly", "Yahoo Finance/Kaggle datasets"],
      "expectedOutputs": "BTC vs ETH comparative line charts, monthly summary tables, volatility insights, and correlation results."
    },
    {
      "id": 4,
      "title": "Predicting Stock Prices with Machine Learning",
      "proposedBy": "Galina Grigoriev",
      "description": "This project applies machine learning to predict stock prices using historical financial data. Students explore data preprocessing, feature engineering, and model building for time-series forecasting.",
      "useCase": "Financial forecasting, investment decision support, and time-series modelling.",
      "skillsGained": [
        "Data preprocessing for time-series",
        "ML model training (e.g., Linear Regression, Random Forest, SVR)",
        "Feature engineering",
        "Evaluation metrics for forecasting"
      ],
      "tools": ["Python", "Pandas", "Scikit-learn", "Matplotlib"],
      "expectedOutputs": "Forecasted price curves, comparison of ML models, and analysis of prediction accuracy."
    }
  ]
}
